/*
Задача 57: Составить частотный словарь элементов двумерного массива.
Частотный словарь содержит информацию о том, сколько раз встречается
элемент входных данных.
*/

//  1. Сначала сделаем функцию с одномерным массивом.

int[] arrey = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10};
Console.WriteLine();